# ETL Data

Sourche: https://www.kaggle.com/datasets/wisnuanggara/daftar-harga-rumah

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('./dataset/DATA RUMAH.xlsx')
df.head()

,NAMA RUMAH,HARGA,LB,LT,KT,KM,GRS
0,"Rumah Murah Hook Tebet Timur, Tebet, Jakarta S...",3800000000,220,220,3,3,0
1,"Rumah Modern di Tebet dekat Stasiun, Tebet, Ja...",4600000000,180,137,4,3,2
2,"Rumah Mewah 2 Lantai Hanya 3 Menit Ke Tebet, T...",3000000000,267,250,4,4,4
3,"Rumah Baru Tebet, Tebet, Jakarta Selatan",430000000,40,25,2,2,0
4,"Rumah Bagus Tebet komp Gudang Peluru lt 350m, ...",9000000000,400,355,6,5,3

In [3]:
df = df.rename(columns={
    'NAMA RUMAH' : 'description',
    'HARGA' : 'price',
    'LB': 'buildingArea',
    'LT': 'landArea',
    'KT': 'bedroom',
    'KM': 'bathroom',
    'GRS': 'garage'
})

df.head()

,description,price,buildingArea,landArea,bedroom,bathroom,garage
0,"Rumah Murah Hook Tebet Timur, Tebet, Jakarta S...",3800000000,220,220,3,3,0
1,"Rumah Modern di Tebet dekat Stasiun, Tebet, Ja...",4600000000,180,137,4,3,2
2,"Rumah Mewah 2 Lantai Hanya 3 Menit Ke Tebet, T...",3000000000,267,250,4,4,4
3,"Rumah Baru Tebet, Tebet, Jakarta Selatan",430000000,40,25,2,2,0
4,"Rumah Bagus Tebet komp Gudang Peluru lt 350m, ...",9000000000,400,355,6,5,3

In [4]:
df['description'] = df['description'].str.lower()
df.head()

,description,price,buildingArea,landArea,bedroom,bathroom,garage
0,"rumah murah hook tebet timur, tebet, jakarta s...",3800000000,220,220,3,3,0
1,"rumah modern di tebet dekat stasiun, tebet, ja...",4600000000,180,137,4,3,2
2,"rumah mewah 2 lantai hanya 3 menit ke tebet, t...",3000000000,267,250,4,4,4
3,"rumah baru tebet, tebet, jakarta selatan",430000000,40,25,2,2,0
4,"rumah bagus tebet komp gudang peluru lt 350m, ...",9000000000,400,355,6,5,3

In [5]:
df.isnull().sum()

description     0
price           0
buildingArea    0
landArea        0
bedroom         0
bathroom        0
garage          0
dtype: int64

In [6]:
df.duplicated().sum()

2

In [7]:
df[df.duplicated(keep=False)]

,description,price,buildingArea,landArea,bedroom,bathroom,garage
116,rumah lama tebet timur,4000000000,200,146,3,1,1
125,"di kebun baru rumah terawat, area strategis",4000000000,139,230,4,4,1
275,rumah lama tebet timur,4000000000,200,146,3,1,1
1007,"di kebun baru rumah terawat, area strategis",4000000000,139,230,4,4,1

In [8]:
df = df.drop_duplicates(keep='first')

In [9]:
df[df['description'].isin(['di kebun baru rumah terawat, area strategis'])]

,description,price,buildingArea,landArea,bedroom,bathroom,garage
125,"di kebun baru rumah terawat, area strategis",4000000000,139,230,4,4,1

# load to new file

In [10]:
df.to_excel('dataset/house_clean.xlsx', index=False)

# load to Mysql

In [11]:
df.columns

Index(['description', 'price', 'buildingArea', 'landArea', 'bedroom',
       'bathroom', 'garage'],
      dtype='object')

In [19]:
df.dtypes

description      object
price           float64
buildingArea    float64
landArea        float64
bedroom           int64
bathroom          int64
garage            int64
dtype: object

In [18]:
df[['price', 'buildingArea', 'landArea']] = df[['price', 'buildingArea', 'landArea']].astype(float)

In [20]:
df.head()

,description,price,buildingArea,landArea,bedroom,bathroom,garage
0,"rumah murah hook tebet timur, tebet, jakarta s...",3.800000e+09,220.0,220.0,3,3,0
1,"rumah modern di tebet dekat stasiun, tebet, ja...",4.600000e+09,180.0,137.0,4,3,2
2,"rumah mewah 2 lantai hanya 3 menit ke tebet, t...",3.000000e+09,267.0,250.0,4,4,4
3,"rumah baru tebet, tebet, jakarta selatan",4.300000e+08,40.0,25.0,2,2,0
4,"rumah bagus tebet komp gudang peluru lt 350m, ...",9.000000e+09,400.0,355.0,6,5,3

In [21]:
from sqlalchemy import create_engine

engine = create_engine('mysql+pymysql://root:@localhost:3306/housedb')

df.to_sql(name='house', con=engine, if_exists='replace', index=False)

1008